Repository: saddamalsalfi/ojs-quickstatements-export
Catalog: locale/*/locale.po
Languages: ar

# plugins.importexport.quickstatements.displayName
source: Wikidata QuickStatements Export
ar: تصدير ويكي داتا (QuickStatements)

# plugins.importexport.quickstatements.description
source: Export issues or articles to Wikidata using QuickStatements.
ar: تصدير الأعداد أو المقالات إلى ويكي داتا باستخدام QuickStatements.

# plugins.importexport.quickstatements.settings
source: Settings
ar: الإعدادات

# plugins.importexport.quickstatements.export.scope
source: Export scope
ar: نطاق التصدير

# plugins.importexport.quickstatements.export.scope.all
source: All published submissions
ar: كل المقالات المنشورة

# plugins.importexport.quickstatements.export.scope.issues
source: Specific issues (IDs)
ar: أعداد محددة (المعرّفات)

# plugins.importexport.quickstatements.export.scope.submissions
source: Specific submissions (IDs)
ar: مقالات محددة (المعرّفات)

# plugins.importexport.quickstatements.export.scope.help
source: Choose what to export.
ar: اختر ما تريد تصديره.

# plugins.importexport.quickstatements.export.ids
source: IDs
ar: المعرّفات

# plugins.importexport.quickstatements.export.ids.help
source: Only required when exporting specific issues or submissions.
ar: مطلوب فقط عند اختيار أعداد/مقالات محددة.

# plugins.importexport.quickstatements.export.format
source: Output format
ar: صيغة الإخراج

# plugins.importexport.quickstatements.export.format.tsv
source: TSV (QuickStatements)
ar: TSV (لـ QuickStatements)

# plugins.importexport.quickstatements.export.format.commands
source: Commands (QuickStatements)
ar: أوامر (QuickStatements)

# plugins.importexport.quickstatements.export.withLabels
source: Include labels/descriptions
ar: تضمين العناوين/الوصف

# plugins.importexport.quickstatements.export.includeAuthors
source: Include authors (P2093) + order
ar: تضمين المؤلفين (P2093) + الترتيب

# plugins.importexport.quickstatements.export.resolveAffil
source: Try affiliations â†’ Wikidata (P1416)
ar: محاولة تحويل الانتماءات إلى ويكي داتا (P1416)

# plugins.importexport.quickstatements.export.includeRefs
source: Include references (P2860)
ar: تضمين المراجع (P2860)

# plugins.importexport.quickstatements.export.resolveRefs
source: Resolve reference DOIs via Wikidata
ar: تحويل DOIs في المراجع عبر ويكي داتا

# plugins.importexport.quickstatements.export.updateIfExists
source: Update existing item if DOI already has a QID
ar: تحديث العنصر إذا كان للـDOI QID مسبقًا

# plugins.importexport.quickstatements.export.run
source: Run export
ar: تنفيذ التصدير

# plugins.importexport.quickstatements.notice.okTitle
source: The batch was submitted to QuickStatements successfully
ar: تم إرسال الدفعة إلى QuickStatements بنجاح

# plugins.importexport.quickstatements.notice.viewBatch
source: View on QuickStatements
ar: متابعة الدفعة على QuickStatements

# plugins.importexport.quickstatements.notice.noCommands
source: No commands to submit (nothing was exported)
ar: لا توجد أوامر للإرسال (لا شيء للتصدير)

# plugins.importexport.quickstatements.notice.errorTitle
source: QuickStatements API error
ar: خطأ من واجهة QuickStatements API

# plugins.importexport.quickstatements.notice.httpCode
source: HTTP code
ar: رمز الاستجابة

# plugins.importexport.quickstatements.settings.heading
source: Wikidata / QuickStatements settings
ar: إعدادات ويكي داتا / QuickStatements

# plugins.importexport.quickstatements.settings.journalQid.label
source: Journal QID (P1433)
ar: QID الخاص بالمجلة (P1433)

# plugins.importexport.quickstatements.settings.journalQid.example
source: Example: Q124499613
ar: مثال: Q124499613

# plugins.importexport.quickstatements.settings.prefLangs.label
source: Preferred language codes
ar: أكواد اللغات المفضلة

# plugins.importexport.quickstatements.settings.prefLangs.help
source: Comma-separated list, e.g. ar,en
ar: اكتبها مفصولة بفواصل، مثل: ar,en

# plugins.importexport.quickstatements.settings.qsUsername.label
source: QuickStatements username
ar: اسم مستخدم QuickStatements

# plugins.importexport.quickstatements.settings.qsBatchPrefix.label
source: Batch name prefix (optional)
ar: بادئة اسم الدفعة (اختياري)

# plugins.importexport.quickstatements.settings.qsToken.label
source: QuickStatements API token
ar: رمز QuickStatements API

# plugins.importexport.quickstatements.settings.qsToken.help
source: Paste exactly as provided by QuickStatements. Used for automatic submit.
ar: يوضع كما زوّدك به QuickStatements. يُستخدم للإرسال التلقائي.

# plugins.importexport.quickstatements.settings.qsAutoSubmit.label
source: Enable automatic submit to QuickStatements instead of downloading a file
ar: تفعيل الإرسال التلقائي إلى QuickStatements بدلاً من تنزيل الملف

# plugins.importexport.quickstatements.settings.qsAutoSubmit.help
source: When enabled, the generated commands are posted directly to QuickStatements.
ar: عند التفعيل سيتم إرسال الأوامر مباشرةً إلى QuickStatements.

# common.saved
source: Settings saved successfully
ar: تم حفظ الاعدادات بنجاح
